In [ ]:
import pandas as pd
data=[1,2,3,4,5,6]
data

[1, 2, 3, 4, 5, 6]

In [15]:
data=[
    "name", "abhishek","lokesha","babu","sanjay","malli"
]
data

['name', 'abhishek', 'lokesha', 'babu', 'sanjay', 'malli']

In [17]:
data=[
    "name","Lokesha","sanjay","babu","malli",
    "age",20,29,19,36
]
data

['name', 'Lokesha', 'sanjay', 'babu', 'malli', 'age', 20, 29, 19, 36]

In [37]:
import pandas as pd
data= {
    'name':["lokesha","babu","sanjay"],
    'email':["lokesha@gmail.com","babu@gmail.com","sanjay@gmail.com"]
}
dataseries=pd.DataFrame(data)
print(dataseries)

      name              email
0  lokesha  lokesha@gmail.com
1     babu     babu@gmail.com
2   sanjay   sanjay@gmail.com

In [38]:
dataseries["age"]=[20,30,26]
dataseries

      name              email  age
0  lokesha  lokesha@gmail.com   20
1     babu     babu@gmail.com   30
2   sanjay   sanjay@gmail.com   26

In [40]:
dataseries["salary"]=[20000,2000,2000]
dataseries

      name              email  age  salary
0  lokesha  lokesha@gmail.com   20   20000
1     babu     babu@gmail.com   30    2000
2   sanjay   sanjay@gmail.com   26    2000

In [42]:
da=pd.DataFrame({"name":["malli"],"email":["malli@gmail.com"],'age':[30],"salary":[2000]})
dataseries=pd.concat([dataseries,da],ignore_index=True)
print(dataseries)

      name              email  age  salary
0  lokesha  lokesha@gmail.com   20   20000
1     babu     babu@gmail.com   30    2000
2   sanjay   sanjay@gmail.com   26    2000
3    malli    malli@gmail.com   30    2000
4    malli    malli@gmail.com   30    2000

In [44]:
dataseries[dataseries["age"]>27]

    name            email  age  salary
1   babu   babu@gmail.com   30    2000
3  malli  malli@gmail.com   30    2000
4  malli  malli@gmail.com   30    2000

In [45]:
dataseries

      name              email  age  salary
0  lokesha  lokesha@gmail.com   20   20000
1     babu     babu@gmail.com   30    2000
2   sanjay   sanjay@gmail.com   26    2000
3    malli    malli@gmail.com   30    2000
4    malli    malli@gmail.com   30    2000

In [46]:
dataseries.describe()

            age        salary
count   5.00000      5.000000
mean   27.20000   5600.000000
std     4.38178   8049.844719
min    20.00000   2000.000000
25%    26.00000   2000.000000
50%    30.00000   2000.000000
75%    30.00000   2000.000000
max    30.00000  20000.000000

In [ ]:
renewable_sources = ["Solar", "Wind", "Hydropower", "Geothermal", "Biomass"]
list = {
    "Project": ["Solar Farm A", "Wind Turbine X", "Hydropower Y", "Solar Roof Z", "Geothermal Plant P"],
    "Technology": ["Solar", "Wind", "Hydropower", "Solar", "Geothermal"],
    "Capacity (MW)": [150, 300, 200, 50, 100],  # Megawatts
    "Cost (Million $)": [200, 400, 350, 100, 250],  # Project cost
    "Location": ["California", "Texas", "Washington", "Nevada", "Idaho"],
    "Completion Year": [2023, 2024, 2022, 2025, 2023]
}
lists=pd.DataFrame(list)
lists

,Project,Technology,Capacity (MW),Cost (Million $),Location,Completion Year
0,Solar Farm A,Solar,150,200,California,2023
1,Wind Turbine X,Wind,300,400,Texas,2024
2,Hydropower Y,Hydropower,200,350,Washington,2022
3,Solar Roof Z,Solar,50,100,Nevada,2025
4,Geothermal Plant P,Geothermal,100,250,Idaho,2023

In [50]:
lists["cost per mw"]=lists["Cost (Million $)"]/lists["Capacity (MW)"]
lists

,Project,Technology,Capacity (MW),Cost (Million $),Location,Completion Year,cost per mw
0,Solar Farm A,Solar,150,200,California,2023,1.333333
1,Wind Turbine X,Wind,300,400,Texas,2024,1.333333
2,Hydropower Y,Hydropower,200,350,Washington,2022,1.750000
3,Solar Roof Z,Solar,50,100,Nevada,2025,2.000000
4,Geothermal Plant P,Geothermal,100,250,Idaho,2023,2.500000

In [ ]:
import numpy as np
energy=np.array({45,45,45,45})
energy.sum()
energy

AttributeError: module 'numpy' has no attribute 'energy'